#pragma once

#include <string>

/**
 *     | Назва       | m (кг) | d (drag) | l (lift) | Тип               |
 *     ------------------------------------------------------------------
 *     | VOG-17      | 0.35   | 0.07     | 0.0      | Вільне падіння    |
 *     | M67         | 0.6    | 0.10     | 0.0      | Вільне падіння    |
 *     | RKG-3       | 1.2    | 0.10     | 0.0      | Вільне падіння    |
 *     | GLIDING-VOG | 0.45   | 0.10     | 1.0      | Планеруючий       |
 *     | GLIDING-RKG | 1.4    | 0.10     | 1.0      | Планеруючий       |
 * 
 *     m — маса боєприпасу (кг)
 *     d — коефіцієнт аеродинамічного опору
 *     l — коефіцієнт підйомної сили (0 = вільне падіння, 1 = планерування).
 */
struct AmmoParams {
	std::string name;
	float mass; 	// маса (кг)
	float drag; 	// коефіцієнт опору
	float lift; 	// коефіцієнт підйому
};